
from config.settings import MAX_PLAYERS

def help_message():
    return f"""Вітаю! Ось доступні команди для гри "Біля озера":

    /help - Показати це повідомлення з допомогою
    /rule - Показати правила гри
    /end_game - Закінчити гру завчасно
    
    Щоб почати, просто введіть /start.
    Гра почнеться, коли в лоббі будуть {MAX_PLAYERS} гравців.
    """

settings_not_available_message = "⚠️ Налаштування доступні лише до початку гри."

def start_message(player_list):
    return (
        f"🎮 Гра розпочалася! Учасники:\n{player_list}\n\n"
    )

greeting_menu_messsge = (
    "🎮 Ласкаво просимо до гри «Біля озера»!\n\n"
    "Це стратегічна гра про управління ресурсами. "
    "Приймайте рішення, стежте за станом озера та збільшуйте свій прибуток!.\n\n"
    "📍 Ви в головному меню. Виберіть один із варіантів нижче:\n"
    "— «Почати гру» — щоб створити або приєднатись до гри\n"
    "— «Налаштування» — щоб змінити параметри\n"
    "— «Правила гри» — щоб переглянути правила гри"
)

