# Кількість гравців у грі
MAX_PLAYERS = 8

# Тривалість гри в місяцях (4 роки = 48 місяців)
GAME_DURATION_MONTHS = 48

ACTION_DUMP_CLEAR_VAL = -1      # Вплив на чистоту води дії "скидання"
ACTION_CLEAN_CLEAR_VAL = 1      # Вплив на чистоту води дії "очищення"

PENALTY_SCORE = -20             # Штраф, якщо гравець вибрав дію "скидання"
BONUS_SCORE = 10               # Бонус для гравців, які вибрали "очищення"

FLOOD_CLEAN_MIN = 2             # Мінімальне очищення озера під час паводку
FLOOD_CLEAN_MAX = 12            # Максимальне очищення озера під час паводку

MEETING_INTERVAL = 8            # Інтервал у місяцях між нарадами
MEETING_DURATION = 180          # Тривалість нараду (у секундах)

FLOOD_INTERVAL = 12             # Інтервал у місяцях між паводками

# Очки для дій "скидання" та "очищення", в залежності від чистоти озера
DUMP_SCORES = [5, 19, 26, 33, 41, 51, 64, 80, 100, 110, 121, 133, 146, 161, 177]
CLEAN_SCORES = [-20, -8, -3, 3, 7, 14, 21, 28, 35, 48, 63, 79, 92, 111, 127]

# Ігрові налаштування з їхніми іконками
SETTINGS_PARAMS = [
    ("MAX_PLAYERS", "👥"),
    ("GAME_DURATION_MONTHS", "📅"),
    ("MEETING_INTERVAL", "🗓"),
    ("BONUS_SCORE", "✅"),
    ("PENALTY_SCORE", "❌")
]