# Кількість гравців у грі
MAX_PLAYERS = 1

# Тривалість гри в місяцях (4 роки = 48 місяців)
GAME_DURATION_MONTHS = 10


SCORE_PENALTY = 20       # Штраф, якщо гравець вибрав дію "скидання води"
SCORE_REWARD_CLEAN = 10   # Бонус для гравців, які вибрали "очищення води"

COST_PENALTY_ACTION = 5   # Витрати для гравця, який обирає дію "штраф" 
COST_REWARD_ACTION = 5    # Витрати для гравця, який вибирає дію "премія"

FLOOD_CLEAN_MIN = 2       # Мінімальне очищення озера під час паводку
FLOOD_CLEAN_MAX = 2     # Максимальне очищення озера під час паводку

MEETING_INTERVAL = 8      # Інтервал у місяцях між нарадами
MEETING_DURATION = 180    # Тривалість нараду (у секундах)