def help_message():
    return """Вітаю! Ось доступні команди для гри "Біля озера":

    /help - Показати це повідомлення з допомогою
    /rule - Показати правила гри
    
    Щоб почати, просто введіть /start, після чого введіть своє ім'я.
    Далі вам треба приєднатися до лоббі.
    Гра почнеться, коли в лоббі будуть 7 гравців.
    """

def rule_message():
    return """
    Гра, яку ми зараз почнемо, називається "Біля озера". 

    У ній імітується використання води для виробничих цілей.

    
    ❗ Правила гри "Біля озера":
    
    🚩 Гра розрахована на 7 гравців.

    🚩 Ми збираємося грати протягом 48 місяців, тобто "прожити" 
    на березі озера 4 роки. Протягом цих 48 місяців кожен з вас 
    повинен прагнути заробити якомога більше балів.

    🚩 Гра протікає у вигляді окремих ходів. 
    Кожен хід робиться раз на місяць і означає 
    ваше рішення щодо очищення відпрацьованих на
    вашому підприємстві води:

    1) скидання води в озеро:
        негативно впливає на чистоту води, 
        але приносить більші прибутки; 
    2) очищення води:
        позитивно впливає на чистоту води, 
        але приносить менші прибутки; 
    3) штраф:
        гравець, який ухвалив це рішення, штрафує всіх тих гравців, 
        які здійснили скидання в даному місяці на 20 балів, 
        але сам несе втрати  у розмірі n балів (n - число учасників);
    4) премія:
        гравець, що ухвалив це рішення, додає 10 балів 
        всім гравцям, які здійснили очищення в даному місяці, 
        але сам несе втрати у розмірі n балів 
        (n - число учасників);

    🚩 Гравці не повинні бачити рішення один одного,
    також заборонено комунікувати, крім 3-хвилинних нарад, 
    які проводяться кожні 9 місяців.

    🚩 Стан води відображається індикатором на ігровій матриці 
    На початку гри якість води в озері знаходиться 
    на "нульовому" рівні, але вона може поліпшуватися 
    або погіршуватися з часом, залежно від ваших дій.
    Положення індикатора вказує на поточний стан води в озері.
    Від якості води залежить прибутковість роботи підприємства.

    🚩 Раз на рік, у квітні, відбувається весняний паводок, 
    в результаті якого озеро самоочищається 
    на випадкове число позицій (від 2 до 12).
    
    
    Удачі та приємної гри!❤
    """
